deasy/Tsung/signup_signout_deleteAcount.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
  <!-- When you copy paste the domain, do it without the protocol-->
    <server host="ec2-44-227-243-49.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
  </servers>

 <!-- 2users  arrive-->
  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- I guess not  that  usefule -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <for from="1" to="10" incr="1" var="counter">

        <!-- Sign up -->
        <!-- The main page-->
        <request subst="true">
          <http url="/" method="GET" version="1.1" />
        </request>
        <!-- Get the sign  up  page-->
        <request subst="true">
          <http url="/users/sign_up" method="GET" version="1.1" />
        </request>
        <!--sign up-->
        <request subst="true">
          <http url="/users/sign_up" method="POST" version="1.1" contents="user[email]=j%%_counter%%@j.com&amp;user[password]=foobar1&amp;user[password_confirmation]=foobar1&amp;commit=Sign up" content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- Edit account -->

        <request subst="true">
          <http url="/users/edit" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/users/edit" method="POST" version="1.1" contents="user[email]=j%%_counter%%@j.com&amp;user[password]=foobar2&amp;user[password_confirmation]=foobar2&amp;user[current_password]=foobar1&amp;commit=Update" content_type="application/x-www-form-urlencoded" />
        </request>
        <!-- Log out -->
        <request subst="true">
          <http url="/users/sign_out" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
        </request>
        <!-- Log in with new email -->
        <request subst="true">
          <http url="/signin" method="POST" version="1.1" contents="session[email]=j%%_counter%%@j.com&amp;session[password]=foobar1&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
        </request>
        <!-- Log out -->
        <request subst="true">
          <http url="/users/sign_out" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
        </request>

      </for>

    </session>
  </sessions>
</tsung>